package com.example.weather.utils

class WindDirection {
    fun getWindDirection(degrees: Int): String {
        return when (degrees) {
            in 0..11 -> "Север"
            in 12..33 -> "Северо-восток"
            in 34..56 -> "Восток"
            in 57..78 -> "Юго-восток"
            in 79..101 -> "Юг"
            in 102..123 -> "Юго-запад"
            in 124..146 -> "Запад"
            in 147..168 -> "Северо-запад"
            in 169..180 -> "Север"
            in 181..193 -> "Юг"
            in 194..213 -> "Юго-запад"
            in 214..236 -> "Запад"
            in 237..258 -> "Северо-запад"
            in 259..281 -> "Север"
            in 282..303 -> "Северо-восток"
            in 304..326 -> "Восток"
            in 327..348 -> "Юго-восток"
            in 349..360 -> "Юг"
            else -> "Неизвестное направление"
        }
    }
}